tools/load-testing/artillery/load-test.yml
config:
  target: 'http://localhost'
  phases:
    - duration: 300
      arrivalRate: 10
      rampTo: 100
scenarios:
  - name: "Homepage and contact form"
    requests:
      - get:
          url: "/"
      - get:
          url: "/?headline=b"
      - post:
          url: "/api/contact"
          json:
            name: "Test User"
            email: "test@example.com"
            message: "This is a load test message"